# DatumPlaneDefinesOrigin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DatumPlaneDefinesOrigin Property
ParameterTypeId Class See Also
---
"Defines Origin"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DatumPlaneDefinesOrigin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DatumPlaneDefinesOrigin As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DatumPlaneDefinesOrigin {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace